Python for Data & Analytics<br>
Chapter 11, section 2

*** requires datafile: DQ-Example-Numeric.csv

In [1]:
import pandas as pd
df = pd.read_csv('DQ-Example-Numeric.csv')
df

    id   age  children_num   salary  taxrate
0    1  21.0           2.0  40000.0       22
1    2  29.4           0.0  50000.0       25
2    3  40.0           1.0     60.0       28
3    4   6.0           2.0  45000.0       21
4  NaN  -1.0          -1.0  52500.0       25
5  six  28.0           1.0  47515.0      100
6    4  26.0           NaN      NaN      105

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            6 non-null      object
 1   age           7 non-null      float64
 2   children_num  6 non-null      float64
 3   salary        6 non-null      float64
 4   taxrate       7 non-null      int64
dtypes: float64(3), int64(1), object(1)
memory usage: 408.0+ bytes

In [3]:
df.taxrate.dtype

dtype('int64')

In [4]:
df['age_clean'] = df['age'].apply(lambda x: None if x < 18 else x)
df['age_clean'] = df['age_clean'].round()
df[['age', 'age_clean']]

    age  age_clean
0  21.0       21.0
1  29.4       29.0
2  40.0       40.0
3   6.0        NaN
4  -1.0        NaN
5  28.0       28.0
6  26.0       26.0

In [5]:
df['children_num_clean'] = \
   df['children_num'].apply(lambda x: None if x < 0 else x)
df[['children_num', 'children_num_clean']]

   children_num  children_num_clean
0           2.0                 2.0
1           0.0                 0.0
2           1.0                 1.0
3           2.0                 2.0
4          -1.0                 NaN
5           1.0                 1.0
6           NaN                 NaN

In [6]:
df['children_num_clean'] = df['children_num_clean'].astype('float16')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  6 non-null      object
 1   age                 7 non-null      float64
 2   children_num        6 non-null      float64
 3   salary              6 non-null      float64
 4   taxrate             7 non-null      int64
 5   age_clean           5 non-null      float64
 6   children_num_clean  5 non-null      float16
dtypes: float16(1), float64(4), int64(1), object(1)
memory usage: 478.0+ bytes

In [7]:
df['taxrate_outlier'] = \
   df['taxrate'].apply(lambda x: True if x >= 100 else False)
df[['taxrate', 'taxrate_outlier']]

   taxrate  taxrate_outlier
0       22            False
1       25            False
2       28            False
3       21            False
4       25            False
5      100             True
6      105             True

In [8]:
df[df.taxrate_outlier]['taxrate']

5    100
6    105
Name: taxrate, dtype: int64

In [9]:
df['taxrate_decimal'] = df['taxrate'] / 100
df[['taxrate', 'taxrate_decimal']]

   taxrate  taxrate_decimal
0       22             0.22
1       25             0.25
2       28             0.28
3       21             0.21
4       25             0.25
5      100             1.00
6      105             1.05

Code from: Python for Data & Analytics, (c) 2023 Rose River Software, LLC